const {getContextInfo} = require('./new')
const config = require('../config')
const {cmd , commands} = require('../command')
const os = require("os")
const {runtime} = require('../lib/functions')
const axios = require('axios')

cmd({

    pattern: "menu",

    react: "📑",

    desc: "Get bot command list.",

    category: "main",

    use: '.menu',

    filename: __filename

},

async(conn, mek, m,{from, l, quoted, body, isCmd, umarmd, args, q, isGroup, sender, senderNumber, botNumber2, botNumber, pushname, isMe, isOwner, groupMetadata, groupName, participants, groupAdmins, isBotAdmins, isAdmins, reply}) => {

try{
let madeMenu = `*╭══〘〘 ${config.BOT_NAME} 〙〙*
*┃❍* *ʀᴜɴᴛɪᴍᴇ* : ${runtime(process.uptime())}
*┃❍* *ᴍᴏᴅᴇ* : *${config.MODE}*
*┃❍* *ᴘʀᴇғɪx* : *${config.PREFIX}*
*┃❍* *ʀᴀᴍ ᴜsᴇ* : ${(process.memoryUsage().heapUsed / 1024 / 1024).toFixed(2)},GB / ${Math.round(require('os').totalmem / 1024 / 1024)},GB
*┃❍* *ᴅᴇᴠ* : *ᴘʀɪɴᴄᴇ ᴛᴇᴄʜ*
*┃❍* *ᴠᴇʀsɪᴏɴs* : *1.0.0*
*╰════════════════⊷*
*╭────❒⁠⁠⁠⁠* *DOWNLOADER-CMD* *❒⁠⁠⁠⁠* 
*├⬡* *.ғʙ*
*├⬡* *.ɪɴꜱᴛᴀ*
*├⬡* *.ᴠɪᴅᴇᴏ*
*├⬡* *.ɢᴅʀɪᴠᴇ*
*├⬡* *.ᴛᴡɪᴛᴛᴇʀ*
*├⬡* *.ᴛᴛ*
*├⬡* *.ᴍᴇᴅɪᴀғɪʀᴇ*
*├⬡* *.ᴘʟᴀʏ*
*├⬡* *.sᴏɴɢ*
*├⬡* *.ᴠɪᴅᴇᴏ*
*├⬡* *.sᴘᴏᴛɪꜰʏ*
*├⬡* *.ᴠɪᴅᴇᴏ4*
*├⬡* *.ɪᴍɢ*
*├⬡* *.Lʏʀɪᴄs*
*├⬡* *.ᴀᴘᴋ*
*├⬡* *.ʙᴀɪsᴄᴏᴘᴇ*
*├⬡* *.ɢɪɴɪsɪsɪʟᴀ*
*┕──────────────❒*
*╭────❒⁠⁠*⁠⁠ *SEARCH-CMD* *❒⁠⁠⁠⁠* 
*├⬡* *.ʏᴛꜱ*
*├⬡* *.ʏᴛᴀ*
*├⬡* *.ᴍᴏᴠɪᴇ*
*├⬡* *.Gᴏᴏɢʟᴇ*
*├⬡* *.ᴡᴇᴀᴛʜᴇʀ*
*├⬡* *.sᴛɪᴄᴋsᴇᴀʀᴄʜ*
*┕──────────────❒*
*╭────❒⁠⁠⁠⁠* *AI-CMD* *❒⁠⁠⁠⁠* 
*├⬡* *.ɢᴘᴛ*
*├⬡* *.ᴀɪ*
*┕──────────────❒*
*╭────❒⁠⁠⁠⁠* *OWNER-CMD* *❒⁠⁠⁠⁠* 
*├⬡* *.ᴜᴘᴅᴀᴛᴇᴄᴍᴅ*
*├⬡* *.sᴇᴛᴛɪɴɢs*
*├⬡* *.ᴏᴡɴᴇʀ*
*├⬡* *.ʀᴇᴘᴏ*
*├⬡* *.ꜱʏꜱᴛᴇᴍ*
*├⬡* *.ꜱᴛᴀᴛᴜꜱ*
*├⬡* *.Aʙᴏᴜᴛ*
*├⬡* *.ʙʟᴏᴄᴋ*
*├⬡* *.ᴜɴʙʟᴏᴄᴋ*
*├⬡* *.sʜᴜᴛᴅᴏᴡɴ*
*├⬡* *.ʙʀᴏᴀᴅᴄᴀsᴛ*
*├⬡* *.ᴊɪᴅ*
*├⬡* *.ɢᴊɪᴅ*
*├⬡* *.ᴘᴀɪʀ*
*├⬡* *.sᴀᴠᴇ*
*├⬡* *.ʀᴇꜱᴛᴀʀᴛ*
*┕───────────────❒*
*╭────❒⁠⁠⁠⁠* *GROUP-CMD* *❒⁠⁠⁠⁠* 
*├⬡* *.ʀᴇᴍᴏᴠᴇ*
*├⬡* *.ᴅᴇʟ*
*├⬡* *.ᴀᴅᴅ*
*├⬡* *.ᴋɪᴄᴋ*
*├⬡* *.ᴋɪᴄᴋᴀʟʟ*
*├⬡* *.ᴘʀᴏᴍᴏᴛᴇ*
*├⬡* *.ᴅᴇᴍᴏᴛᴇ*
*├⬡* *.ᴛᴀɢᴀʟʟ*
*├⬡* *.ɪɴᴠɪᴛᴇ*
*├⬡* *.ʀᴇᴠᴏᴋᴇ*
*├⬡* *.ᴘᴏʟʟ*
*├⬡* *.ʀᴀɴᴅᴏᴍsʜɪᴘ*
*├⬡* *.ɴᴇᴡɢᴄ*
*├⬡* *.ᴍᴜᴛᴇ*
*├⬡* *.ᴜɴᴍᴜᴛᴇ*
*├⬡* *.ʟᴏᴄᴋɢᴄ*
*├⬡* *.ᴜɴʟᴏᴄᴋɢᴄ*
*├⬡* *.ʟᴇᴀᴠᴇ*
*├⬡* *.ɢɴᴀᴍᴇ*
*├⬡* *.ɢᴅᴇsᴄ*
*├⬡* *.ᴊᴏɪɴ*
*├⬡* *.ʜɪᴅᴇᴛᴀɢ*
*├⬡* *.ɢɪɴғᴏ*
*┕──────────────❒*
*╭────❒⁠⁠⁠⁠* *INFO-CMD* *❒⁠⁠⁠⁠* 
*├⬡* *.ᴀʙᴏᴜᴛ*
*├⬡* *.ᴀʟɪᴠᴇ*
*├⬡* *.ʀᴇǫᴜᴇsᴛ*
*├⬡* *.ʙᴏᴛɪɴꜰᴏ*
*├⬡* *.ꜱᴛᴀᴛᴜꜱ*
*├⬡* *.ᴘɪɴɢ*
*├⬡* *.ꜱʏꜱᴛᴇᴍ*
*┕──────────────❒*
*╭────❒⁠⁠⁠⁠* *BOT-CMD* *❒⁠⁠⁠⁠* 
*├⬡* *.ʀᴇᴘᴏ*
*├⬡* *.ᴍᴇɴᴜ*
*├⬡* *.ᴜᴘᴅᴀᴛᴇ*
*├⬡* *.ᴍᴇɴᴜ2*
*├⬡* *.ᴍᴏᴅᴇ*
*├⬡* *.ᴀᴜᴛᴏᴛʏᴘɪɴɢ*
*├⬡* *.ᴀʟᴡᴀʏsᴏɴʟɪɴᴇ*
*├⬡* *.ᴀᴜᴛᴏʀᴇᴄᴏʀᴅɪɴɢ*
*├⬡* *.ᴀᴜᴛᴏʀᴇᴀᴅsᴛᴀᴛᴜs*
*├⬡* *.ᴀɴᴛɪʙᴀᴅ*
*├⬡* *.ᴀᴜᴛᴏsᴛɪᴄᴋᴇʀ*
*├⬡* *.ᴀᴜᴛᴏʀᴇᴘʟʏ*
*├⬡* *.ᴀᴜᴛᴏʀᴇᴀᴄᴛ*
*├⬡* *.ᴀɴᴛɪʟɪɴᴋ*
*┕──────────────❒*
*╭────❒⁠⁠⁠⁠* *CONVERTER-CMD* *❒⁠⁠⁠⁠* 
*├⬡* *.sᴛɪᴄᴋᴇʀ*
*├⬡* *.ᴛᴀᴋᴇ*
*├⬡* *.ᴛʀᴛ*
*├⬡* *.ᴛᴛs*
*├⬡* *.ꜰᴀɴᴄʏ*
*├⬡* *.ᴜʀʟ*
*├⬡* *.Aɢᴇ*
*├⬡* *.Cᴏɴᴠᴇʀᴛ*
*├⬡* *.ᴛɪɴʏ*
*┕─────────────❒*
*╭────❒⁠⁠⁠⁠* *RANDOM-CMD* *❒⁠⁠⁠⁠* 
*├⬡* *.ᴀɴɪᴍᴇ*
*├⬡* *.ᴄᴏᴜᴘʟᴇᴘᴘ*
*├⬡* *.ʟᴏʟɪ*
*├⬡* *.ᴡᴀɪꜰᴜ*
*├⬡* *.ᴄᴏsᴘʟᴀʏ*
*├⬡* *.ɴᴇᴋᴏ*
*├⬡* *.ʀᴀɴᴅᴏᴍᴀɴɪᴍᴇ*
*┕──────────────❒*
*╭────❒⁠⁠⁠⁠* *WALLPAPERS-CMD* *❒⁠⁠⁠⁠* 
*├⬡* *.ɪᴍɢ*
*├⬡* *.ʟᴏɢᴏ*
*├⬡* *.ss*
*┕──────────────❒*
*╭────❒⁠⁠⁠⁠* *OTHER-CMD* *❒⁠⁠⁠⁠* 
*├⬡* *.ᴛʀᴛ*
*├⬡* *.ᴊᴏᴋᴇ*
*├⬡* *.ꜰᴀᴄᴛ*
*├⬡* *.ɢɪᴛʜᴜʙ*
*├⬡* *.ɢᴘᴀꜱꜱ*
*├⬡* *.ʜᴀᴄᴋ*
*├⬡* *.vv*
*├⬡* *.vv2*
*├⬡* *.sᴘᴀᴍ*
*├⬡* *.ᴠᴄᴀʀᴅ*
*├⬡* *.ꜱʀᴇᴘᴏ*
*├⬡* *.sʏsᴛᴇᴍ*
*├⬡* *.ʀᴀɴᴋ*
*├⬡* *.Tɪᴍᴇᴢᴏɴᴇ*
*├⬡* *.ᴅᴇꜰɪɴᴇ*
*├⬡* *.Dᴀɪʟʏꜰᴀᴄᴛ*
*┕─────────────❒*
> ᴘᴏᴡᴇʀᴇᴅ ʙʏ ᴘʀɪɴᴄᴇ ᴛᴇᴄʜ 
`

await conn.sendMessage(from,{image:{url:config.ALIVE_IMG},             
caption:madeMenu,
   contextInfo: getContextInfo(m.sender),
                            },
 { quoted: mek });
}catch(e){
console.log(e)
reply(`${e}`)
}
})
